app/controllers/books_controller.rb

    def index
        if params[:category].blank?
        @books = Book.all.order("created_at DESC")
        else
            @category_id = Category.find_by(name: params[:category]).id
            @books = Book.where(:category_id => @category_id).order("created_at DESC")
---
SELECT "categories".* FROM "categories"
SELECT "books".* FROM "books" ORDER BY created_at DESC
SELECT "categories".* FROM "categories" WHERE "categories"."name" = ? LIMIT ?  [["name", "Fantasy"], ["LIMIT", 1]]
SELECT "books".* FROM "books" WHERE "books"."category_id" = ? ORDER BY created_at DESC  [["category_id", 3]]

    def show
        if @book.reviews.blank?
            @average_review = 0
        else
            @average_review = @book.reviews.average(:rating)
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."book_id" = ?  [["book_id", 18]]
SELECT AVG("reviews"."rating") FROM "reviews" WHERE "reviews"."book_id" = ?  [["book_id", 18]]

    def create
     @book = current_user.books.build(book_params)
     @book.category_id = params[:category_id]

     if @book.save
---
INSERT INTO "books" ("title", "description", "author", "created_at", "updated_at", "user_id", "category_id") VALUES (?, ?, ?, ?, ?, ?, ?)

    def update
        @book.category_id = params[:category_id]
        if @book.update(book_params)
---
UPDATE "books" SET "title" = ?, "description" = ?, "author" = ?, "updated_at" = ?, "book_img_file_name" = ?, "book_img_file_size" = ?, "book_img_updated_at" = ? WHERE "books"."id" = ?