app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("comment", "created_at", "updated_at", "user_id", "book_id") VALUES (?, ?, ?, ?, ?)  [["comment", "Nice book."], ["created_at", "2021-04-20 14:17:25.446567"], ["updated_at", "2021-04-20 14:17:25.446567"], ["user_id", 1], ["book_id", 13]]
---
    def create
        @review = Review.new(review_params)
        @review.book_id = @book.id
        @review.user_id = current_user.id
        if @review.save

UPDATE "reviews" SET "comment" = ?, "updated_at" = ? WHERE "reviews"."id" = ?  [["comment", "Great boodasdsdassdk! Nice"], ["updated_at", "2021-04-18 16:27:05.522291"], ["id", 1]]
---
    def update

        if @review.update(review_params)