app/views/layouts/application.html.erb

SELECT "categories".* FROM "categories"
---
        <ul class="dropdown-menu" aria-labelledby="dropdownMenuButton1">
          <% Category.all.each do |category| %>